snlkuharlocal/src/ExchangePlans/ДанныеЧЗ/ДанныеЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="bcd48a61-0904-4c3c-9823-6927205c0c6c">
  <name>ДанныеЧЗ</name>
  <attributes>
    <name>ТипУзла</name>
    <type>
      <types>EnumRef.ТипУзлаИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

snlkuharlocal/src/Enums/ТипыСообщенийЛога/ТипыСообщенийЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийЛога</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/СтатистикаОбменов/СтатистикаОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатистикаОбменов</name>
  <attributes>
    <name>Операция</name>
    <comment>Загрузка-Выгрузка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЗаписиОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработанныеОбъекты</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/ExchangePlans/ДанныеЧЗ/ObjectModule.bsl
Перем ЗагруженныеДокументы;
Перем ВыгруженныеДокументы;

Перем мЭтотУзел;
Перем мЭтотУзел_Код;
Перем ОшибкаЗаписиОбъекта;
Перем ТипТекущегоУзла;
Перем СбойЗагрузки;

Перем ОбработанныеОбъекты;
Перем ОшибкиЗагрузки;

Перем НомерСообщения;
Перем Отправитель;

Перем ИмяЛога;

Процедура ЗаписатьВТаблицуОбмена(ТО,Данные,Результат,Описание="")
	СтрокаТЗ	= ТО.Добавить();
	
	МетаОбъект	= Данные.Метаданные();
	
	СтрокаТЗ.Вид = МетаОбъект.Имя;
	ЗаполнитьЗначенияСвойств(СтрокаТЗ,Данные);
	
	СтрокаТЗ.ПредставлениеВида = "" + МетаОбъект;
	
	СтрокаТЗ.Результат		= Результат;
	СтрокаТЗ.Описание		= Описание;
	СтрокаТЗ.Ссылка			= Данные.Ссылка;
КонецПроцедуры

Функция СоздатьТаблицуОшибок()
	ОшибкиЗагрузки		=Новый ТаблицаЗначений;
	ОшибкиЗагрузки.Колонки.Добавить("ТипОбъекта");
	ОшибкиЗагрузки.Колонки.Добавить("Описание");
КонецФункции // СоздатьТаблицуОшибок()

Функция ЗаписатьСообщениеСИзменениями(ПротВыгрузки = Неопределено, Автомат = Ложь) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	ЗаписатьВЛог(ИмяЛога, "Начало выгрузки в узел: " + Ссылка.Код, Перечисления.ТипыСообщенийЛога.Информация);
	
	НачалоОбработки 	= ТекущаяДата();	
	
	ИмяФайла 			= СформироватьИмяФайлаОбмена("_W");
	
	НомерСообщения 		= ЗаписатьНовоеСообщение(ИмяФайла);
	
	КонецФормированияСообщения = ТекущаяДата();
	
	рОтправки			= ОпубликоватьФайлОбмена(ИмяФайла, НомерСообщения, Ссылка);
	
	КонецОбработки		= ТекущаяДата();
	
	СпрОбъект = Справочники.СтатистикаОбменов.СоздатьЭлемент();
	
	СпрОбъект.УстановитьНовыйКод(ПланыОбмена.ДанныеЧЗ.ЭтотУзел().Код);
	СпрОбъект.Операция			= "Выгрузка";
	СпрОбъект.Отправитель		= ПараметрыСеанса.ЭтотУзел.Код;
	СпрОбъект.Получатель		= Код;	
	СпрОбъект.НомерСообщения	= НомерСообщения;
	СпрОбъект.НачалоОбработки	= НачалоОбработки;
	СпрОбъект.КонецОбработки	= КонецОбработки;
	СпрОбъект.Пользователь		= ПараметрыСеанса.Пользователь;
	
	Если ТипЗнч(ОбработанныеОбъекты) = Тип("Соответствие") Тогда
		Для Каждого Элемент Из ОбработанныеОбъекты Цикл
			СтрокаТЧ = СпрОбъект.ОбработанныеОбъекты.Добавить();		
			СтрокаТЧ.Тип		= Элемент.Ключ;
			СтрокаТЧ.Количество	= Элемент.Значение;
		КонецЦикла; 	
	КонецЕсли;
	
	Если рОтправки.Результат Тогда
		Результат.Успешно = Истина;
	Иначе		
		СпрОбъект.ОшибкаВыполнения = Результат.Описание;			
		Результат.Ошибки.Добавить(Результат.Описание);
	КонецЕсли; 
	
	СпрОбъект.Записать();	
	
	ЗаписатьВЛог(ИмяЛога, "Конец выгрузки в узел: "+Ссылка.Код,Перечисления.ТипыСообщенийЛога.Информация);	
	
	ПротВыгрузки = ВыгруженныеДокументы;
	
	Возврат Результат;
КонецФункции// ЗаписатьСообщениеСИзменениями()

Функция ПрочитатьСообщениеСИзменениями(Контроль = Истина, ПротЗагр = Неопределено) Экспорт
	Перем НомерСообщения;
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	НеЗагружатьДвижения = Новый Соответствие;
	
	ОбработанныеОбъекты	= Новый Соответствие;
		
	СоздатьТаблицуОшибок();	
	
	ИмяФайла = СформироватьИмяФайлаОбмена("_R");	
	
	ЗаписатьВЛог(ИмяЛога, "Загрузка данных для узла: " + Код, Перечисления.ТипыСообщенийЛога.Информация);	
	
	НачалоОбработки = ТекущаяДата();
	
	ФайлПолучен 	= ПолучитьФайлОбменаСеть(ИмяФайла, Ссылка);
	
	НомерСообщения  = Неопределено;
	Отправитель		= Неопределено;
	
	Если ФайлПолучен Тогда		
		Попытка			
			// Читаем полученное сообщение из файла	
			рЧтения		= ПрочитатьНовоеСообщение(ИмяФайла, Контроль);
			
			ПротЗагр 	= ЗагруженныеДокументы;	
			
			Если рЧтения.Успешно Тогда			
				Результат.Успешно = Истина;				
			Иначе
				Результат = рЧтения;
			КонецЕсли;			
		Исключение			
			ТекстСообщения = СтрШаблон("Ошибка получения сообщения ! Отправитель: '%1'. Ошибка: %2", Отправитель, ОписаниеОшибки());
			ЗаписатьВЛог("ОбменДаннымиОсновной", ТекстСообщения,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
			
			Результат.Ошибки.ДОбавить(ТекстСообщения);			
		КонецПопытки;
		
		Если ЗначениеЗаполнено(НомерСообщения) Тогда			
			// Удаляем файлы со старыми сообщениями обмена
			УдалитьФайлыОбмена(НомерСообщения, Ссылка); 			
		КонецЕсли;		
	Иначе
		ТекстСообщения = СтрШаблон("Нет сообщений для узла: '%1'", Код);
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, Перечисления.ТипыСообщенийЛога.Информация);	
		
		Результат.Ошибки.Добавить(ТекстСообщения);
	КонецЕсли;
	
	Попытка		
		УдалитьФайлы(ИмяФайла);		
	Исключение
		ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка удаления полученных файлов ! Отправитель: " + Код,Перечисления.ТипыСообщенийЛога.Ошибка);	
	КонецПопытки;
	
	КонецОбработки = ТекущаяДата();	
	
	СпрОбъект	= Справочники.СтатистикаОбменов.СоздатьЭлемент();
	СпрОбъект.УстановитьНовыйКод(мЭтотУзел_Код);
	
	СпрОбъект.Операция			= "Загрузка";
	СпрОбъект.Отправитель		= Отправитель;
	СпрОбъект.Получатель		= мЭтотУзел_Код;	
	СпрОбъект.НомерСообщения	= НомерСообщения;
	СпрОбъект.НачалоОбработки	= НачалоОбработки;
	СпрОбъект.КонецОбработки	= КонецОбработки;
	СпрОбъект.Пользователь		= ПараметрыСеанса.Пользователь;
	
	Если ТипЗнч(ОбработанныеОбъекты) = Тип("Соответствие") Тогда
		Для Каждого Элемент Из ОбработанныеОбъекты Цикл
			СтрокаТЧ	= СпрОбъект.ОбработанныеОбъекты.Добавить();		
			СтрокаТЧ.Тип		= Элемент.Ключ;
			СтрокаТЧ.Количество	= Элемент.Значение;
		КонецЦикла; 	
	КонецЕсли;
	
	Для Каждого СтрокаОшибки Из ОшибкиЗагрузки Цикл
		СтрокаТЧ = СпрОбъект.Ошибки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаОшибки);	
	КонецЦикла; 
	
	Если НЕ Результат.Успешно Тогда
		СпрОбъект.ОшибкаВыполнения = СтрСоединить(Результат.Ошибки, Символы.ПС);
		
	КонецЕсли; 
	
	СпрОбъект.Записать();
	
	ЗаписатьВЛог(ИмяЛога, "Конец загрузки из: " + Код, Перечисления.ТипыСообщенийЛога.Информация);
	
	Возврат Результат;
КонецФункции // ПрочитатьСообщениеСИзменениями()

Функция СформироватьИмяФайлаОбмена(Суффикс)
	КаталогВременныхФайлов = СокрЛП(КаталогВременныхФайлов());
	Если Прав(КаталогВременныхФайлов,1)<>"\" Тогда
		КаталогВременныхФайлов=КаталогВременныхФайлов+"\";	
	КонецЕсли;	
	Возврат КаталогВременныхФайлов + ПолучитьИмяФайлаОбмена(мЭтотУзел, Ссылка, Суффикс);
КонецФункции // ()
 

Процедура УдалениеДанных(Данные) 

	ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
		Или Метаданные.Документы.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда		
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных)
		Или Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных.Родитель)
		Или Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
		
		// Очищаем данные
		Данные.Очистить();
		
	КонецЕсли;	
	
КонецПроцедуры // УдалениеДанных(Данные)

Функция ЗаписатьНовоеСообщение(ИмяФайла, ТО = Неопределено)	
	ОбработанныеОбъекты = Новый Соответствие;
	
	НомерСообщения = 0;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);	
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");
		
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	
	ЗаписатьВЛог(ИмяЛога, "Начало формирования сообщения: " + НомерСообщения, Перечисления.ТипыСообщенийЛога.Информация);	
	
	Счетчик = 0;
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Счетчик = Счетчик + 1;
			Если Счетчик % 100 = 0 Тогда			
				Состояние("Выгрузка данных: " + Строка(Счетчик));
			КонецЕсли;			
		#КонецЕсли
		
		Данные = ВыборкаИзменений.Получить();		
		
		ЗаписатьДанные(ЗаписьXML, Данные);		
		
		ТипДанных 			= ТипЗнч(Данные);
		КоличествоОбъектов 	= МаркировкаКС.ПолучитьЗначениеПараметра(ОбработанныеОбъекты, ТипДанных, 0);		
		ОбработанныеОбъекты[ТипДанных] = КоличествоОбъектов + 1;
	КонецЦикла;	
	
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗаписьXML.Закрыть();
	
	ЗаписатьВЛог(ИмяЛога, "Окончание формирования сообщения: " + НомерСообщения, Перечисления.ТипыСообщенийЛога.Информация);	
	
	Возврат НомерСообщения;	
КонецФункции // ЗаписатьНовоеСообщение(ИмяФайла)

Функция ЗаписатьДанныеВБазу(Данные, ТипДанных, Отправитель)	
		
	Если ТипДанных = "Документ" Тогда
		Данные.ОбменДанными.Отправитель = Отправитель;		
	Иначе		
		Если НЕ ПланыОбмена.ИзменениеЗарегистрировано(Отправитель, Данные) Тогда			
			Данные.ОбменДанными.Отправитель = Отправитель;
		КонецЕсли;	
	КонецЕсли;
		
	Данные.ОбменДанными.Загрузка = Истина;		
	
	НовыйОбъект = Ложь;
	Попытка		
		Если ТипДанных = "Документ" ИЛИ ТипДанных = "Справочник" Тогда
			НовыйОбъект = Данные.Ссылка.Пустая();
		ИначеЕсли ТипДанных = "РегистрНакопления" Тогда
			Возврат Ложь;		
		КонецЕсли;		
		
		Если ТипДанных = "Документ" Тогда						
			ОчиститьДвижения(Данные);			
			Если Данные.Проведен Тогда
				Данные.Записать();				
				Отказ = Ложь;
				Данные.ОбработкаПроведения(Отказ,РежимПроведенияДокумента.Неоперативный);
			Иначе
				Данные.Записать();			
			КонецЕсли;		
		Иначе
			Данные.Записать();		
		КонецЕсли; 
		
		//УдалитьИзЖурналаРассогласований(ИсходныеДанные,Отправитель);
		Возврат Истина;
	Исключение
		ТекстОшибки=ОписаниеОшибки();
		
		//ЗаписатьВЖурналРассогласований(ИсходныеДанные, Отправитель, "Ошибка записи ! " + ТекстОшибки);
		
		Описание = СтрШаблон("Ошибка записи объекта: %1. Причина: %2.", Данные, ТекстОшибки);
		ЗаписатьВЛог("Ошибки записи при обмене", Описание, "Ошибка");		
		
		Если ТипЗнч(ОшибкиЗагрузки)<>Тип("ТаблицаЗначений") Тогда
			СоздатьТаблицуОшибок();				
		КонецЕсли;		
		
		СтрокаОшибки = ОшибкиЗагрузки.Добавить();
		СтрокаОшибки.ТипОбъекта	= ТипЗнч(Данные);
		СтрокаОшибки.Описание	= Описание;
		
		Возврат Ложь;
	КонецПопытки;
КонецФункции // ЗаписатьОбъектвБазу() 

Функция ПрочитатьНовоеСообщение(ИмяФайла, Контроль = Истина)
	Результат = МаркировкаКС.СтруктураРезультата();
	//ЗаписатьВПротоколОбмена(ВидЗаписи,Источник,НомерСообщения,Данные=Неопределено,Ошибка=Неопределено) Экспорт
	
	СбойЗагрузки = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	
	НомерСообщения	 				= ЧтениеСообщения.НомерСообщения;
	ПараметрыСеанса.НомерСообщения	= НомерСообщения;
	
	Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
		ВызватьИсключение "Неверный узел";		
	КонецЕсли;
	
	Отправитель		= ЧтениеСообщения.Отправитель;
	
	ТипПолучателя	= мЭтотУзел.ТипУзла;
	ТипОтправителя	= ТипУзла;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, ЧтениеСообщения.НомерПринятого);
	
	// Читаем данные из сообщения пока это возможно
	Счетчик = 0;
	Пока ВозможностьЧтенияДанных(ЧтениеXML) Цикл
		
		// Читаем очередное значение
		Данные = ПрочитатьДанные(ЧтениеXML);
		
		#Если Клиент Тогда
			Счетчик = Счетчик + 1;
			Состояние("Загрузка данных: " + Строка(Счетчик));
		#КонецЕсли	
		
		Описание		="";
		ОбъектЗагружен			= Ложь;
		ОбъектЗагруженЧастично	= Ложь;
		НовыйОбъект				= Ложь;
		ЕстьРассогласования		= Ложь;
		ОтправитьОбратно		= Ложь;
		
		ТипДанных				= ТипОбъекта(Данные);
		
		Если ТипДанных  = "Удаление" Тогда			
			//крохин конец 27.01.2012
			Продолжить;
		КонецЕсли;	
						
		
		ОбъектЗагружен	= ЗаписатьДанныеВБазу(Данные, ТипДанных, Отправитель);
		
		Если ТипДанных = "Документ" Тогда
			Если ОбъектЗагружен ИЛИ ОбъектЗагруженЧастично Тогда
				Если ЕстьРассогласования Тогда
					ЗаписатьВТаблицуОбмена(ЗагруженныеДокументы, Данные, ?(НовыйОбъект, "Загружен новый (ЧАСТИЧНО)", "Частично изменен существующий"));
				Иначе
					ЗаписатьВТаблицуОбмена(ЗагруженныеДокументы, Данные, ?(НовыйОбъект, "Загружен новый", "Изменен существующий"));
				КонецЕсли;
				
				Если ОтправитьОбратно Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(ЧтениеСообщения.Отправитель,Данные);
				КонецЕсли; 
			Иначе
				ЗаписатьВТаблицуОбмена(ЗагруженныеДокументы, Данные, "Не загружен", Описание);
			КонецЕсли;						
		КонецЕсли;		
		
		ТипДанных = ТипЗнч(Данные);
		КоличествоОбъектов = МаркировкаКС.ПолучитьЗначениеПараметра(ОбработанныеОбъекты, ТипДанных, 0);
		ОбработанныеОбъекты[ТипДанных] = КоличествоОбъектов + 1;
	КонецЦикла;
	
	Если СбойЗагрузки Тогда
		ЧтениеСообщения.ПрерватьЧтение();
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Сбой загрузки !");
	Иначе
		ЧтениеСообщения.ЗакончитьЧтение();
	КонецЕсли; 	
	
	ЧтениеXML.Закрыть();
	
	Результат.Данные = Новый Структура("Отправитель,НомерСообщения", Отправитель, НомерСообщения);
	
	Возврат Результат;	
КонецФункции // ПрочитатьНовоеСообщение(ИмяФайла)

Процедура ЗаписатьДанные(ЗаписьXML, Данные)	
	Попытка
		ЗаписатьXML(ЗаписьXML, Данные);	
	Исключение
		ЗаписатьВЛог(ИмяЛога, "Ошибка выгрузки объекта: " + Данные, "Ошибка", Истина);
	КонецПопытки;	
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Данные));
	Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
		ЗаписатьВТаблицуОбмена(ВыгруженныеДокументы, Данные, "Выгружен");	
	КонецЕсли;	
КонецПроцедуры // ЗаписатьДанные(ЗаписьXML, Данные)

Функция ВозможностьЧтенияДанных(ЧтениеXML)	
	// Получаем тип данных XML, который может быть считан в данный момент
	ТипXML = ПолучитьXMLТип(ЧтениеXML);
	Если ТипXML = Неопределено Тогда Возврат Ложь КонецЕсли;	
	
	Возврат ВозможностьЧтенияXML(ЧтениеXML);	
КонецФункции // ВозможностьЧтенияДанных(ЧтениеXML)

Функция ПрочитатьДанные(ЧтениеXML)	
	ТипXML = ПолучитьXMLТип(ЧтениеXML);
	Если ТипXML = Неопределено Тогда Возврат Неопределено КонецЕсли;		
	
	Возврат ПрочитатьXML(ЧтениеXML);	
КонецФункции // ПрочитатьДанные(ЧтениеXML)

Процедура ПередЗаписью(Отказ)
	Для Сч=1  По 2 Цикл
			
	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьДвижения(Данные) Экспорт
	Если Данные.Ссылка.Пустая() Тогда Возврат КонецЕсли;
	
	Для Каждого Движение Из Данные.Метаданные().Движения Цикл
		Данные.Движения[Движение.Имя].Очистить();
		Данные.Движения[Движение.Имя].Записать();
	КонецЦикла;
КонецПроцедуры //ОчиститьДвижения(Данные) Экспорт

Функция КлассОбъекта(Данные)
	МетаОбъект = Метаданные.НайтиПоТипу(Данные);
	
	Если МетаОбъект = Неопределено Тогда Возврат "" КонецЕсли;
	
	Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
		Возврат "Документ";	
	ИначеЕсли Метаданные.Справочники.Содержит(МетаОбъект) Тогда
		Возврат "Справочник";	
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаОбъект) Тогда
		Возврат "РегистрНакопления";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
		Возврат "РегистрСведений";
	Иначе
		Возврат "";			
	КонецЕсли; 

КонецФункции //КлассОбъекта(Данные)
 
ИмяПланаОбмена	= Метаданные().Имя;
ТипТекущегоУзла = Маркировка_ПИ.ТипТекущегоУзла(ИмяПланаОбмена);
мЭтотУзел		= Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена);
мЭтотУзел_Код	= Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена);

ИмяЛога			= "ОбменДанными_ДанныеЧЗ";
